Revit 2027 API
PanelScheduleData.UpdateLoadSummary Method
 Update the load summary section
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateLoadSummary()
Public Sub UpdateLoadSummary
public:
void UpdateLoadSummary()
member UpdateLoadSummary : unit -> unit
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace